michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
/*
 * Copyright (c) 2020 - 2026 Renesas Electronics Corporation and/or its affiliates
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/**********************************************************************************************************************
 * File Name    : hw_sce_ra_private.h
 * Version      : 1.09
 * Description  : SCE function private header file.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_sce_if.h"
#include "SCE_ProcCommon.h"

#ifndef HW_SCE_RA_PRIVATE_HEADER_FILE
 #define HW_SCE_RA_PRIVATE_HEADER_FILE

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/

/* Byte swapping macro */
 #define RSIP_PRV_BSWAP_32_C(data)    ((((data) & 0xff000000U) >> 24) | (((data) & 0x00ff0000U) >> 8) | \
                                       (((data) & 0x0000ff00U) << 8) | (((data) & 0x000000ffU) << 24))

 #if SCE_SECURE_BOOT != 0

/* Required for each variable definition with no initial value to be placed in the SECURE_BOOT section. */
  #define SCE_PRV_SEC_B_SECURE_BOOT    R_BSP_ATTRIB_SECTION_CHANGE(B, SECURE_BOOT, 4)

/* Required for each function definition to be placed in the SECURE_BOOT section. */
  #define SCE_PRV_SEC_P_SECURE_BOOT    R_BSP_ATTRIB_SECTION_CHANGE(P, SECURE_BOOT)

/* Revert to default section. */
  #define SCE_PRV_SEC_DEFAULT          R_BSP_ATTRIB_SECTION_CHANGE_END
 #else

/* Required for each variable definition with no initial value to be placed in the SECURE_BOOT section.(dummy) */
  #define SCE_PRV_SEC_B_SECURE_BOOT

/* Required for each function definition to be placed in the SECURE_BOOT section.(dummy) */
  #define SCE_PRV_SEC_P_SECURE_BOOT

/* Revert to default section.(dummy) */
  #define SCE_PRV_SEC_DEFAULT
 #endif                                /* SCE_SECURE_BOOT != 0 */

 #define SIZE_AES_128BIT_KEYLEN_BITS_WRAPPED         (288)
 #define SIZE_AES_128BIT_KEYLEN_BYTES_WRAPPED        ((SIZE_AES_128BIT_KEYLEN_BITS_WRAPPED) / 8)
 #define SIZE_AES_128BIT_KEYLEN_WORDS_WRAPPED        ((SIZE_AES_128BIT_KEYLEN_BITS_WRAPPED) / 32)

 #define SIZE_AES_192BIT_KEYLEN_BITS_WRAPPED         (448) /* Added 32 bits here to differentiate 192 wrapped key from 256 wrapped key in the psa_crypto stack. */
 #define SIZE_AES_192BIT_KEYLEN_BYTES_WRAPPED        ((SIZE_AES_192BIT_KEYLEN_BITS_WRAPPED) / 8)
 #define SIZE_AES_192BIT_KEYLEN_WORDS_WRAPPED        ((SIZE_AES_192BIT_KEYLEN_BITS_WRAPPED) / 32)

 #define SIZE_AES_256BIT_KEYLEN_BITS_WRAPPED         (416)
 #define SIZE_AES_256BIT_KEYLEN_BYTES_WRAPPED        ((SIZE_AES_256BIT_KEYLEN_BITS_WRAPPED) / 8)
 #define SIZE_AES_256BIT_KEYLEN_WORDS_WRAPPED        ((SIZE_AES_256BIT_KEYLEN_BITS_WRAPPED) / 32)

 #define SIZE_AES_XTS_128BIT_KEYLEN_BITS_WRAPPED     (416)
 #define SIZE_AES_XTS_128BIT_KEYLEN_BYTES_WRAPPED    ((SIZE_AES_XTS_128BIT_KEYLEN_BITS_WRAPPED) / 8)
 #define SIZE_AES_XTS_128BIT_KEYLEN_WORDS_WRAPPED    ((SIZE_AES_XTS_128BIT_KEYLEN_BITS_WRAPPED) / 32)

 #define SIZE_AES_XTS_256BIT_KEYLEN_BITS_WRAPPED     (672)
 #define SIZE_AES_XTS_256BIT_KEYLEN_BYTES_WRAPPED    ((SIZE_AES_XTS_256BIT_KEYLEN_BITS_WRAPPED) / 8)
 #define SIZE_AES_XTS_256BIT_KEYLEN_WORDS_WRAPPED    ((SIZE_AES_XTS_256BIT_KEYLEN_BITS_WRAPPED) / 32)

/** Return RSA wrapped private key size in bytes from the specified RSA modulus size in bits.
 * This is the size of sce_rsa2048_private_key_index_t.
 */
 #define RSA_WRAPPED_PRIVATE_KEY_SIZE_BYTES(RSA_SIZE_BITS)    ((RSA_SIZE_BITS / 8U) + 532U)

/** Return size of any additional info generated by HW for the specified RSA modulus size in bits
 * This is the size of everything in sce_rsa2048_public_key_index_t other than public key N
 */
 #define RSA_ADDITIONAL_KEY_INFO_SIZE_BYTES(RSA_SIZE_BITS)    ((1U * 4U) + 4U + 12U + (68U * 4U))

/** Return RSA public key size in bytes from the specified RSA modulus size in bits.
 * This is the size of sce_rsa2048_public_key_index_t.
 */
 #define RSA_WRAPPED_PUBLIC_KEY_SIZE_BYTES(RSA_SIZE_BITS)     (((RSA_SIZE_BITS) / 8U) + \
                                                               RSA_ADDITIONAL_KEY_INFO_SIZE_BYTES)

/** Return RSA CRT private key size in bytes from the specified RSA modulus size in bits */
 #define RSA_PLAIN_TEXT_CRT_KEY_SIZE_BYTES(RSA_SIZE_BITS)     (0U)

/** Return RSA domain parameter size in bytes from the specified RSA modulus size in bits.
 * This is not provided, but dummy values are used since mbedCrypto requires some values
 * in Q and P in order to export them.
 */
 #define RSA_PARAMETERS_SIZE_BYTES(RSA_SIZE_BITS)             (5U)

/** DER encoded size for wrapped RSA key */
 #define RSA_WRAPPED_1024_EXPORTED_DER_SIZE_BYTES     (1600U)
 #define RSA_WRAPPED_2048_EXPORTED_DER_SIZE_BYTES     (1600U)
 #define RSA_WRAPPED_3072_EXPORTED_DER_SIZE_BYTES     (1500U)
 #define RSA_WRAPPED_4096_EXPORTED_DER_SIZE_BYTES     (1700U)

 #define ECC_256_FORMATTED_PUBLIC_KEY_LENGTH_WORDS    (21U)
 #define ECC_384_FORMATTED_PUBLIC_KEY_LENGTH_WORDS    (29U)

 #define ECC_256_PRIVATE_KEY_HRK_LENGTH_WORDS         (13U)
 #define ECC_256_PRIVATE_KEY_HRK_LENGTH_BITS          (416U)

 #define ECC_384_PRIVATE_KEY_HRK_LENGTH_WORDS         (17U)
 #define ECC_384_PRIVATE_KEY_HRK_LENGTH_BITS          (544U)

 #define ECC_521_PRIVATE_KEY_HRK_LENGTH_BITS          (800U)

 #define ECC_DUMMY_DOMAIN_PARAM_SIZE                  (1)

/**********************************************************************************************************************
 * Global Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * External global variables
 *********************************************************************************************************************/

extern uint32_t const S_FLASH2[];

