michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
extern uint32_t S_RAM[HW_SCE_SRAM_WORD_SIZE];
extern uint32_t S_HEAP[HW_SCE_SHEAP_WORD_SIZE];
extern uint32_t S_INST[HW_SCE_SINST_WORD_SIZE];
extern uint32_t S_INST2[HW_SCE_SINST2_WORD_SIZE];

extern SCE_GEN_MAC_CB_FUNC_T SCE_GEN_MAC_CB_FUNC;

extern uint32_t       INST_DATA_SIZE;
extern const uint32_t sce_oem_key_size[SCE_OEM_CMD_NUM];

extern uint32_t const DomainParam_NIST_P192[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_NIST_P224[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_NIST_P256[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_NIST_P384[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_NIST_P521[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_NIST_Ed25519[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_Brainpool_256r1[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_Brainpool_384r1[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_Brainpool_512r1[ECC_DUMMY_DOMAIN_PARAM_SIZE];
extern uint32_t const DomainParam_Koblitz_secp256k1[ECC_DUMMY_DOMAIN_PARAM_SIZE];

/**********************************************************************************************************************
 * Exported global functions
 *********************************************************************************************************************/

/* -------- Initialization and Control -------- */
void      HW_SCE_SoftwareResetSub(void);
fsp_err_t HW_SCE_SelfCheck1Sub(void);
void      HW_SCE_SelfCheck1SubSub(void);
fsp_err_t HW_SCE_SelfCheck2Sub(void);
void      HW_SCE_SelfCheck2SubSub(void);
fsp_err_t HW_SCE_SelfCheck3Sub(void);
fsp_err_t HW_SCE_LoadHukSub(uint32_t InData_LC[]);
fsp_err_t HW_SCE_GenerateOemKeyIndexSub(uint32_t InData_KeyType[],
                                        uint32_t InData_Cmd[],
                                        uint32_t InData_SharedKeyIndex[],
                                        uint32_t InData_SessionKey[],
                                        uint32_t InData_IV[],
                                        uint32_t InData_InstData[],
                                        uint32_t OutData_KeyIndex[]);
fsp_err_t HW_SCE_UpdateOemKeyIndexSub(uint32_t * InData_LC,
                                      uint32_t * InData_Cmd,
                                      uint32_t * InData_IV,
                                      uint32_t * InData_InstData,
                                      uint32_t * OutData_KeyIndex);
uint32_t change_endian_long(uint32_t data);

/* -------- Key Index Generation (Installed Key) -------- */
fsp_err_t HW_SCE_GenerateAes128KeyIndexSub(uint32_t * InData_SharedKeyIndex,
                                           uint32_t * InData_SessionKey,
                                           uint32_t * InData_IV,
                                           uint32_t * InData_InstData,
                                           uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateAes192KeyIndexSub(uint32_t * InData_SharedKeyIndex,
                                           uint32_t * InData_SessionKey,
                                           uint32_t * InData_IV,
                                           uint32_t * InData_InstData,
                                           uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateAes256KeyIndexSub(uint32_t * InData_SharedKeyIndex,
                                           uint32_t * InData_SessionKey,
                                           uint32_t * InData_IV,
                                           uint32_t * InData_InstData,
                                           uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateRsa2048PublicKeyIndexSub(uint32_t * InData_KeyType,
                                                  uint32_t * InData_SharedKeyIndex,
                                                  uint32_t * InData_SessionKey,
                                                  uint32_t * InData_IV,
                                                  uint32_t * InData_InstData,
                                                  uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateRsa2048PrivateKeyIndexSub(uint32_t * InData_KeyType,
                                                   uint32_t * InData_SharedKeyIndex,
                                                   uint32_t * InData_SessionKey,
                                                   uint32_t * InData_IV,
                                                   uint32_t * InData_InstData,
                                                   uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateEccP384PublicKeyIndexSub(uint32_t * InData_KeyType,
                                                  uint32_t * InData_SharedKeyIndex,
                                                  uint32_t * InData_SessionKey,
                                                  uint32_t * InData_IV,
                                                  uint32_t * InData_InstData,
                                                  uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateEccP384PrivateKeyIndexSub(uint32_t * InData_KeyType,
                                                   uint32_t * InData_SharedKeyIndex,
                                                   uint32_t * InData_SessionKey,
                                                   uint32_t * InData_IV,
                                                   uint32_t * InData_InstData,
                                                   uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateEccPublicKeyIndexSub(uint32_t * InData_KeyType,
                                              uint32_t * InData_SharedKeyIndex,
                                              uint32_t * InData_SessionKey,
                                              uint32_t * InData_CurveType,
                                              uint32_t * InData_Cmd,
                                              uint32_t * InData_IV,
                                              uint32_t * InData_InstData,
                                              uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateEccPrivateKeyIndexSub(uint32_t * InData_KeyType,
                                               uint32_t * InData_SharedKeyIndex,
                                               uint32_t * InData_SessionKey,
                                               uint32_t * InData_CurveType,
                                               uint32_t * InData_Cmd,
                                               uint32_t * InData_IV,
                                               uint32_t * InData_InstData,
                                               uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateShaHmacKeyIndexSub(uint32_t * InData_KeyType,
                                            uint32_t * InData_SharedKeyIndex,
                                            uint32_t * InData_SessionKey,
                                            uint32_t * InData_Cmd,
                                            uint32_t * InData_IV,
                                            uint32_t * InData_InstData,
                                            uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_GenerateTlsP256EccKeyIndexSub(uint32_t * OutData_KeyIndex, uint32_t * OutData_PubKey);

