michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
/* -------- Random Key Generation -------- */
fsp_err_t HW_SCE_GenerateAes128RandomKeyIndexSub(uint32_t OutData_KeyIndex[]);
fsp_err_t HW_SCE_GenerateAes192RandomKeyIndexSub(uint32_t OutData_KeyIndex[]);
fsp_err_t HW_SCE_GenerateAes256RandomKeyIndexSub(uint32_t OutData_KeyIndex[]);
fsp_err_t HW_SCE_GenerateAes128XtsRandomKeyIndexSub(uint32_t OutData_KeyIndex[]);
fsp_err_t HW_SCE_GenerateAes256XtsRandomKeyIndexSub(uint32_t OutData_KeyIndex[]);
fsp_err_t HW_SCE_GenerateRsa1024RandomKeyIndexSub(uint32_t MAX_CNT,
                                                  uint32_t InData_KeyType[],
                                                  uint32_t OutData_PubKeyIndex[],
                                                  uint32_t OutData_PubKey[],
                                                  uint32_t OutData_PrivKeyIndex[],
                                                  uint32_t OutData_PrivKey[]);
fsp_err_t HW_SCE_GenerateRsa2048RandomKeyIndexSub(uint32_t MAX_CNT,
                                                  uint32_t InData_KeyType[],
                                                  uint32_t OutData_PubKeyIndex[],
                                                  uint32_t OutData_PubKey[],
                                                  uint32_t OutData_PrivKeyIndex[],
                                                  uint32_t OutData_PrivKey[]);
fsp_err_t HW_SCE_GenerateRsa3072RandomKeyIndexSub(const uint32_t InData_KeyMode[],
                                                  const uint32_t MAX_CNT,
                                                  uint32_t       OutData_PubKeyIndex[],
                                                  uint32_t       OutData_PubKey[],
                                                  uint32_t       OutData_PrivKeyIndex[],
                                                  uint32_t       OutData_PrivKey[]);
fsp_err_t HW_SCE_GenerateRsa4096RandomKeyIndexSub(uint32_t   MAX_CNT,
                                                  uint32_t * OutData_PubKeyIndex,
                                                  uint32_t * OutData_PrivKeyIndex);
fsp_err_t HW_SCE_GenerateEccP384RandomKeyIndexSub(const uint32_t InData_CurveType[],
                                                  const uint32_t InData_KeyType[],
                                                  uint32_t       OutData_PubKeyIndex[],
                                                  uint32_t       OutData_PubKey[],
                                                  uint32_t       OutData_PrivKeyIndex[],
                                                  uint32_t       OutData_PrivKey[]);
fsp_err_t HW_SCE_GenerateEccP384RandomKeyIndexSubAdaptor(const uint32_t * InData_CurveType,
                                                         const uint32_t * InData_KeyType,
                                                         const uint32_t   InData_DomainParam[],
                                                         uint32_t       * OutData_PubKeyIndex,
                                                         uint32_t       * OutData_PubKey,
                                                         uint32_t       * OutData_PrivKeyIndex,
                                                         uint32_t       * OutData_PrivKey);
fsp_err_t HW_SCE_GenerateEccRandomKeyIndexSub(const uint32_t InData_CurveType[],
                                              const uint32_t InData_Cmd[],
                                              const uint32_t InData_KeyType[],
                                              uint32_t       OutData_PubKeyIndex[],
                                              uint32_t       OutData_PubKey[],
                                              uint32_t       OutData_PrivKeyIndex[],
                                              uint32_t       OutData_PrivKey[]);
fsp_err_t HW_SCE_GenerateEccRandomKeyIndexSubAdaptor(const uint32_t * InData_CurveType,
                                                     const uint32_t * InData_Cmd,
                                                     const uint32_t * InData_KeyType,
                                                     const uint32_t   InData_DomainParam[],
                                                     uint32_t       * OutData_PubKeyIndex,
                                                     uint32_t       * OutData_PubKey,
                                                     uint32_t       * OutData_PrivKeyIndex,
                                                     uint32_t       * OutData_PrivKey);
fsp_err_t HW_SCE_GenerateRandomNumberSub(uint32_t OutData_Text[]);
fsp_err_t HW_SCE_GenerateUpdateKeyRingKeyIndexSub(uint32_t * InData_LC,
                                                  uint32_t * InData_SharedKeyIndex,
                                                  uint32_t * InData_SessionKey,
                                                  uint32_t * InData_IV,
                                                  uint32_t * InData_InstData,
                                                  uint32_t * OutData_InstData);
fsp_err_t HW_SCE_GenerateUpdateKeyRingKeyIndexSub(uint32_t * InData_LC,
                                                  uint32_t * InData_SharedKeyIndex,
                                                  uint32_t * InData_SessionKey,
                                                  uint32_t * InData_IV,
                                                  uint32_t * InData_InstData,
                                                  uint32_t * OutData_InstData);

/* -------- Key Index Update -------- */
fsp_err_t HW_SCE_UpdateAes128KeyIndexSub(uint32_t * InData_IV, uint32_t * InData_InstData, uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateAes192KeyIndexSub(uint32_t * InData_IV, uint32_t * InData_InstData, uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateAes256KeyIndexSub(uint32_t * InData_IV, uint32_t * InData_InstData, uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateRsa2048PublicKeyIndexSub(uint32_t * InData_IV,
                                                uint32_t * InData_InstData,
                                                uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateRsa2048PrivateKeyIndexSub(uint32_t * InData_IV,
                                                 uint32_t * InData_InstData,
                                                 uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateEccP384PublicKeyIndexSub(uint32_t * InData_IV,
                                                uint32_t * InData_InstData,
                                                uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateEccP384PrivateKeyIndexSub(uint32_t * InData_IV,
                                                 uint32_t * InData_InstData,
                                                 uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateEccPublicKeyIndexSub(uint32_t * InData_Cmd,
                                            uint32_t * InData_IV,
                                            uint32_t * InData_InstData,
                                            uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_UpdateEccPrivateKeyIndexSub(uint32_t * InData_Cmd,
                                             uint32_t * InData_IV,
                                             uint32_t * InData_InstData,
                                             uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_Ecc256ScalarMultiplicationPrivate(uint32_t * InData_CurveType,
                                                   uint32_t * InData_Cmd,
                                                   uint32_t * InData_KeyIndex,
                                                   uint32_t * InData_PubKey,
                                                   uint32_t * OutData_R);
fsp_err_t HW_SCE_Ecc256ScalarMultiplicationSub(const uint32_t InData_CurveType[],
                                               const uint32_t InData_Cmd[],
                                               const uint32_t InData_KeyIndex[],
                                               const uint32_t InData_PubKey[],
                                               uint32_t       OutData_R[]);
fsp_err_t HW_SCE_Ecc256ScalarMultiplicationSubAdaptor(const uint32_t InData_CurveType[],
                                                      const uint32_t InData_Cmd[],
                                                      const uint32_t InData_KeyIndex[],
                                                      const uint32_t InData_PubKey[],
                                                      const uint32_t InData_DomainParam[],
                                                      uint32_t       OutData_R[]);
fsp_err_t HW_SCE_Ecc384ScalarMultiplicationPrivate(uint32_t * InData_CurveType,
                                                   uint32_t * InData_KeyIndex,
                                                   uint32_t * InData_PubKey,
                                                   uint32_t * OutData_R);
fsp_err_t HW_SCE_Ecc384ScalarMultiplicationSub(const uint32_t InData_CurveType[],
                                               const uint32_t InData_KeyIndex[],
                                               const uint32_t InData_PubKey[],
                                               uint32_t       OutData_R[]);
fsp_err_t HW_SCE_Ecc384ScalarMultiplicationSubAdaptor(const uint32_t InData_CurveType[],
                                                      const uint32_t InData_Cmd[],
                                                      const uint32_t InData_KeyIndex[],
                                                      const uint32_t InData_PubKey[],
                                                      const uint32_t InData_DomainParam[],
                                                      uint32_t       OutData_R[]);
fsp_err_t HW_SCE_EccEd25519ScalarMultiplicationSubAdaptor(const uint32_t InData_CurveType[],
                                                          const uint32_t InData_Cmd[],
                                                          const uint32_t InData_KeyIndex[],
                                                          const uint32_t InData_PubKey[],
                                                          const uint32_t InData_DomainParam[],
                                                          uint32_t       OutData_R[]);

/* -------- Firmware Update -------- */
fsp_err_t HW_SCE_StartUpdateFirmwareSub(void);
void      firm_mac_read(uint32_t * InData_Program);

