michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
/* -------- AES -------- */
fsp_err_t HW_SCE_Aes128EcbEncryptInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes128EcbEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128EcbEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes192EcbEncryptInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes192EcbEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192EcbEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes256EcbEncryptInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes256EcbEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256EcbEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes128EcbDecryptInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes128EcbDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128EcbDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes192EcbDecryptInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes192EcbDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192EcbDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes256EcbDecryptInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes256EcbDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256EcbDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes128CbcEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes128CbcEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CbcEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes192CbcEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes192CbcEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CbcEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes256CbcEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes256CbcEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CbcEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes128CbcDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes128CbcDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CbcDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes192CbcDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes192CbcDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CbcDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes256CbcDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes256CbcDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CbcDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes128CtrEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_ICOUNTER);
fsp_err_t HW_SCE_Aes128CtrEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CtrEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes192CtrEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_ICOUNTER);
fsp_err_t HW_SCE_Aes192CtrEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CtrEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes256CtrEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_ICOUNTER);
fsp_err_t HW_SCE_Aes256CtrEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CtrEncryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes128CtrDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_ICOUNTER);
fsp_err_t HW_SCE_Aes128CtrDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CtrDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes192CtrDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_ICOUNTER);
fsp_err_t HW_SCE_Aes192CtrDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CtrDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes256CtrDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_ICOUNTER);
fsp_err_t HW_SCE_Aes256CtrDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CtrDecryptFinalPrivate(uint32_t * OutData_Text, uint32_t * OutData_length);
fsp_err_t HW_SCE_Aes128XtsEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes128XtsEncryptInitSub(uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128XtsEncryptInitSubGeneral(uint32_t InData_KeyMode[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_Key[],
                                                uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128XtsEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes128XtsEncryptUpdateSub(uint32_t InData_Text[], uint32_t OutData_Text[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128XtsEncryptFinalPrivate(uint32_t * InData_TextBitLen,
                                              uint32_t * InData_Text,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes128XtsEncryptFinalSub(uint32_t InData_TextBitLen[], uint32_t InData_Text[],
                                          uint32_t OutData_Text[]);
fsp_err_t HW_SCE_Aes256XtsEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes256XtsEncryptInitSub(uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes256XtsEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes256XtsEncryptUpdateSub(uint32_t InData_Text[], uint32_t OutData_Text[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256XtsEncryptFinalPrivate(uint32_t * InData_TextBitLen,
                                              uint32_t * InData_Text,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes256XtsEncryptFinalSub(uint32_t InData_TextBitLen[], uint32_t InData_Text[],
                                          uint32_t OutData_Text[]);
fsp_err_t HW_SCE_Aes128XtsDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes128XtsDecryptInitSub(uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128XtsDecryptInitSubGeneral(uint32_t InData_KeyMode[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_Key[],
                                                uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128XtsDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes128XtsDecryptUpdateSub(uint32_t InData_Text[], uint32_t OutData_Text[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128XtsDecryptFinalPrivate(uint32_t * InData_TextBitLen,
                                              uint32_t * InData_Text,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes128XtsDecryptFinalSub(uint32_t InData_TextBitLen[], uint32_t InData_Text[],
                                          uint32_t OutData_Text[]);
fsp_err_t HW_SCE_Aes256XtsDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes256XtsDecryptInitSub(uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes256XtsDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes256XtsDecryptUpdateSub(uint32_t InData_Text[], uint32_t OutData_Text[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256XtsDecryptFinalPrivate(uint32_t * InData_TextBitLen,
                                              uint32_t * InData_Text,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes256XtsDecryptFinalSub(uint32_t InData_TextBitLen[], uint32_t InData_Text[],
                                          uint32_t OutData_Text[]);
fsp_err_t HW_SCE_Aes128GcmEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes128GcmEncryptInitSub(uint32_t InData_KeyType[], uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128GcmEncryptInitSubGeneral(uint32_t * InData_KeyType,
                                                uint32_t * InData_DataType,
                                                uint32_t * InData_Cmd,
                                                uint32_t * InData_KeyIndex,
                                                uint32_t * InData_IV,
                                                uint32_t * InData_SeqNum);
fsp_err_t HW_SCE_Aes128GcmEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT, uint32_t * OutData_Text);
void      HW_SCE_Aes128GcmEncryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128GcmEncryptUpdateAadPrivate(uint32_t * InData_DataA, uint32_t MAX_CNT);
void      HW_SCE_Aes128GcmEncryptUpdateAADSub(const uint32_t InData_DataA[], const uint32_t MAX_CNT);
void      HW_SCE_Aes128GcmEncryptUpdateTransitionPrivate(void);
void      HW_SCE_Aes128GcmEncryptUpdateTransitionSub(void);
fsp_err_t HW_SCE_Aes128GcmEncryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_DataALen,
                                              uint32_t * InData_TextLen,
                                              uint32_t * OutData_Text,
                                              uint32_t * OutData_DataT);
fsp_err_t HW_SCE_Aes128GcmEncryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_DataALen[],
                                          uint32_t       OutData_Text[],
                                          uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes192GcmEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes192GcmEncryptInitSub(uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes192GcmEncryptInitSubGeneral(uint32_t * InData_KeyType,
                                                uint32_t * InData_DataType,
                                                uint32_t * InData_Cmd,
                                                uint32_t * InData_KeyIndex,
                                                uint32_t * InData_IV,
                                                uint32_t * InData_SeqNum);
fsp_err_t HW_SCE_Aes192GcmEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT, uint32_t * OutData_Text);
void      HW_SCE_Aes192GcmEncryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192GcmEncryptUpdateAadPrivate(uint32_t * InData_DataA, uint32_t MAX_CNT);
void      HW_SCE_Aes192GcmEncryptUpdateAADSub(const uint32_t InData_DataA[], const uint32_t MAX_CNT);
void      HW_SCE_Aes192GcmEncryptUpdateTransitionPrivate(void);
void      HW_SCE_Aes192GcmEncryptUpdateTransitionSub(void);
fsp_err_t HW_SCE_Aes192GcmEncryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_DataALen,
                                              uint32_t * InData_TextLen,
                                              uint32_t * OutData_Text,
                                              uint32_t * OutData_DataT);
fsp_err_t HW_SCE_Aes192GcmEncryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_DataALen[],
                                          uint32_t       OutData_Text[],
                                          uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes256GcmEncryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes256GcmEncryptInitSub(uint32_t InData_KeyType[], uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes256GcmEncryptInitSubGeneral(uint32_t * InData_KeyType,
                                                uint32_t * InData_DataType,
                                                uint32_t * InData_Cmd,
                                                uint32_t * InData_KeyIndex,
                                                uint32_t * InData_IV,
                                                uint32_t * InData_SeqNum);
fsp_err_t HW_SCE_Aes256GcmEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT, uint32_t * OutData_Text);
void      HW_SCE_Aes256GcmEncryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256GcmEncryptUpdateAadPrivate(uint32_t * InData_DataA, uint32_t MAX_CNT);
void      HW_SCE_Aes256GcmEncryptUpdateAADSub(const uint32_t InData_DataA[], const uint32_t MAX_CNT);
void      HW_SCE_Aes256GcmEncryptUpdateTransitionPrivate(void);
void      HW_SCE_Aes256GcmEncryptUpdateTransitionSub(void);
fsp_err_t HW_SCE_Aes256GcmEncryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_DataALen,
                                              uint32_t * InData_TextLen,
                                              uint32_t * OutData_Text,
                                              uint32_t * OutData_DataT);
fsp_err_t HW_SCE_Aes256GcmEncryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_DataALen[],
                                          uint32_t       OutData_Text[],
                                          uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes128GcmDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes128GcmDecryptInitSub(uint32_t InData_KeyType[], uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128GcmDecryptInitSubGeneral(uint32_t * InData_KeyType,
                                                uint32_t * InData_DataType,
                                                uint32_t * InData_Cmd,
                                                uint32_t * InData_KeyIndex,
                                                uint32_t * InData_IV,
                                                uint32_t * InData_SeqNum);
fsp_err_t HW_SCE_Aes128GcmDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT, uint32_t * OutData_Text);
void      HW_SCE_Aes128GcmDecryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128GcmDecryptUpdateAadPrivate(uint32_t * InData_DataA, uint32_t MAX_CNT);
void      HW_SCE_Aes128GcmDecryptUpdateAADSub(const uint32_t InData_DataA[], const uint32_t MAX_CNT);
void      HW_SCE_Aes128GcmDecryptUpdateTransitionPrivate(void);
void      HW_SCE_Aes128GcmDecryptUpdateTransitionSub(void);
fsp_err_t HW_SCE_Aes128GcmDecryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_DataT,
                                              uint32_t * InData_DataALen,
                                              uint32_t * InData_TextLen,
                                              uint32_t * InData_DataTLen,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes128GcmDecryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_DataALen[],
                                          const uint32_t InData_DataT[],
                                          const uint32_t InData_DataTLen[],
                                          uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Aes192GcmDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes192GcmDecryptInitSub(uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes192GcmDecryptInitSubGeneral(uint32_t * InData_KeyType,
                                                uint32_t * InData_DataType,
                                                uint32_t * InData_Cmd,
                                                uint32_t * InData_KeyIndex,
                                                uint32_t * InData_IV,
                                                uint32_t * InData_SeqNum);
fsp_err_t HW_SCE_Aes192GcmDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT, uint32_t * OutData_Text);
void      HW_SCE_Aes192GcmDecryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192GcmDecryptUpdateAadPrivate(uint32_t * InData_DataA, uint32_t MAX_CNT);
void      HW_SCE_Aes192GcmDecryptUpdateAADSub(const uint32_t InData_DataA[], const uint32_t MAX_CNT);
void      HW_SCE_Aes192GcmDecryptUpdateTransitionPrivate(void);
void      HW_SCE_Aes192GcmDecryptUpdateTransitionSub(void);
fsp_err_t HW_SCE_Aes192GcmDecryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_DataT,
                                              uint32_t * InData_DataALen,
                                              uint32_t * InData_TextLen,
                                              uint32_t * InData_DataTLen,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes192GcmDecryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_DataALen[],
                                          const uint32_t InData_DataT[],
                                          const uint32_t InData_DataTLen[],
                                          uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Aes256GcmDecryptInitPrivate(sce_aes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_Aes256GcmDecryptInitSub(uint32_t InData_KeyType[], uint32_t InData_KeyIndex[], uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes256GcmDecryptInitSubGeneral(uint32_t * InData_KeyType,
                                                uint32_t * InData_DataType,
                                                uint32_t * InData_Cmd,
                                                uint32_t * InData_KeyIndex,
                                                uint32_t * InData_IV,
                                                uint32_t * InData_SeqNum);
fsp_err_t HW_SCE_Aes256GcmDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT, uint32_t * OutData_Text);
void      HW_SCE_Aes256GcmDecryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256GcmDecryptUpdateAadPrivate(uint32_t * InData_DataA, uint32_t MAX_CNT);
void      HW_SCE_Aes256GcmDecryptUpdateAADSub(const uint32_t InData_DataA[], const uint32_t MAX_CNT);
void      HW_SCE_Aes256GcmDecryptUpdateTransitionPrivate(void);
void      HW_SCE_Aes256GcmDecryptUpdateTransitionSub(void);
fsp_err_t HW_SCE_Aes256GcmDecryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_DataT,
                                              uint32_t * InData_DataALen,
                                              uint32_t * InData_TextLen,
                                              uint32_t * InData_DataTLen,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes256GcmDecryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_DataALen[],
                                          const uint32_t InData_DataT[],
                                          const uint32_t InData_DataTLen[],
                                          uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Aes128CcmEncryptInitPrivate(sce_aes_key_index_t * KeyIndex,
                                             uint32_t            * InData_IV,
                                             uint32_t            * InData_Header,
                                             uint32_t              Header_Len);
fsp_err_t HW_SCE_Aes128CcmEncryptInitSub(uint32_t InData_KeyType[],
                                         uint32_t InData_DataType[],
                                         uint32_t InData_Cmd[],
                                         uint32_t InData_TextLen[],
                                         uint32_t InData_KeyIndex[],
                                         uint32_t InData_IV[],
                                         uint32_t InData_Header[],
                                         uint32_t Header_Len,
                                         uint32_t InData_SeqNum[]);
fsp_err_t HW_SCE_Aes128CcmEncryptInitSubGeneral(uint32_t InData_KeyType[],
                                                uint32_t InData_DataType[],
                                                uint32_t InData_Cmd[],
                                                uint32_t InData_TextLen[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_IV[],
                                                uint32_t InData_Header[],
                                                uint32_t InData_SeqNum[],
                                                uint32_t Header_Len);
fsp_err_t HW_SCE_Aes128CcmEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes128CcmEncryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CcmEncryptFinalPrivate(const uint32_t * InData_TextLen,
                                              const uint32_t * InData_Text,
                                              uint32_t       * OutData_Text,
                                              uint32_t       * OutData_MAC);
