michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
fsp_err_t HW_SCE_Aes128CcmEncryptFinalSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                          uint32_t OutData_MAC[]);
fsp_err_t HW_SCE_Aes128CcmEncryptFinalSubGeneral(const uint32_t * InData_Text,
                                                 const uint32_t * InData_TextLen,
                                                 uint32_t       * OutData_Text,
                                                 uint32_t       * OutData_MAC);
fsp_err_t HW_SCE_Aes192CcmEncryptInitPrivate(sce_aes_key_index_t * KeyIndex,
                                             uint32_t            * InData_IV,
                                             uint32_t            * InData_Header,
                                             uint32_t              Header_Len);
fsp_err_t HW_SCE_Aes192CcmEncryptInitSub(uint32_t InData_KeyIndex[],
                                         uint32_t InData_IV[],
                                         uint32_t InData_Header[],
                                         uint32_t Header_Len);
fsp_err_t HW_SCE_Aes192CcmEncryptInitSubGeneral(uint32_t InData_KeyType[],
                                                uint32_t InData_DataType[],
                                                uint32_t InData_Cmd[],
                                                uint32_t InData_TextLen[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_IV[],
                                                uint32_t InData_Header[],
                                                uint32_t InData_SeqNum[],
                                                uint32_t Header_Len);
fsp_err_t HW_SCE_Aes192CcmEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes192CcmEncryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CcmEncryptFinalPrivate(uint32_t * InData_TextLen,
                                              uint32_t * InData_Text,
                                              uint32_t * OutData_Text,
                                              uint32_t * OutData_MAC);
fsp_err_t HW_SCE_Aes192CcmEncryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          uint32_t       OutData_Text[],
                                          uint32_t       OutData_MAC[]);
fsp_err_t HW_SCE_Aes256CcmEncryptInitPrivate(sce_aes_key_index_t * KeyIndex,
                                             uint32_t            * InData_IV,
                                             uint32_t            * InData_Header,
                                             uint32_t              Header_Len);
fsp_err_t HW_SCE_Aes256CcmEncryptInitSub(uint32_t InData_KeyIndex[],
                                         uint32_t InData_IV[],
                                         uint32_t InData_Header[],
                                         uint32_t Header_Len);
fsp_err_t HW_SCE_Aes256CcmEncryptInitSubGeneral(uint32_t InData_KeyType[],
                                                uint32_t InData_DataType[],
                                                uint32_t InData_Cmd[],
                                                uint32_t InData_TextLen[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_IV[],
                                                uint32_t InData_Header[],
                                                uint32_t InData_SeqNum[],
                                                uint32_t Header_Len);
fsp_err_t HW_SCE_Aes256CcmEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes256CcmEncryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CcmEncryptFinalPrivate(uint32_t * InData_TextLen,
                                              uint32_t * InData_Text,
                                              uint32_t * OutData_Text,
                                              uint32_t * OutData_MAC);
fsp_err_t HW_SCE_Aes256CcmEncryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          uint32_t       OutData_Text[],
                                          uint32_t       OutData_MAC[]);
fsp_err_t HW_SCE_Aes128CcmDecryptInitPrivate(sce_aes_key_index_t * KeyIndex,
                                             uint32_t            * InData_IV,
                                             uint32_t            * InData_Header,
                                             uint32_t              Header_Len);
fsp_err_t HW_SCE_Aes128CcmDecryptInitSub(uint32_t InData_KeyType[],
                                         uint32_t InData_DataType[],
                                         uint32_t InData_Cmd[],
                                         uint32_t InData_TextLen[],
                                         uint32_t InData_MACLength[],
                                         uint32_t InData_KeyIndex[],
                                         uint32_t InData_IV[],
                                         uint32_t InData_Header[],
                                         uint32_t Header_Len,
                                         uint32_t InData_SeqNum[]);
fsp_err_t HW_SCE_Aes128CcmDecryptInitSubGeneral(uint32_t InData_KeyType[],
                                                uint32_t InData_DataType[],
                                                uint32_t InData_Cmd[],
                                                uint32_t InData_TextLen[],
                                                uint32_t InData_MACLength[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_IV[],
                                                uint32_t InData_Header[],
                                                uint32_t InData_SeqNum[],
                                                uint32_t Header_Len);
fsp_err_t HW_SCE_Aes128CcmDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes128CcmDecryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CcmDecryptFinalPrivate(const uint32_t * InData_Text,
                                              const uint32_t * InData_TextLen,
                                              const uint32_t * InData_MAC,
                                              const uint32_t * InData_MACLength,
                                              uint32_t       * OutData_Text);
fsp_err_t HW_SCE_Aes128CcmDecryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_MAC[],
                                          uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Aes128CcmDecryptFinalSubGeneral(const uint32_t * InData_Text,
                                                 const uint32_t * InData_TextLen,
                                                 const uint32_t * InData_MAC,
                                                 const uint32_t * InData_MACLength,
                                                 uint32_t       * OutData_Text);
fsp_err_t HW_SCE_Aes192CcmDecryptInitPrivate(sce_aes_key_index_t * KeyIndex,
                                             uint32_t            * InData_IV,
                                             uint32_t            * InData_Header,
                                             uint32_t              Header_Len);
fsp_err_t HW_SCE_Aes192CcmDecryptInitSub(uint32_t InData_KeyIndex[],
                                         uint32_t InData_IV[],
                                         uint32_t InData_Header[],
                                         uint32_t Header_Len);
fsp_err_t HW_SCE_Aes192CcmDecryptInitSubGeneral(uint32_t InData_KeyType[],
                                                uint32_t InData_DataType[],
                                                uint32_t InData_Cmd[],
                                                uint32_t InData_TextLen[],
                                                uint32_t InData_MACLength[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_IV[],
                                                uint32_t InData_Header[],
                                                uint32_t InData_SeqNum[],
                                                uint32_t Header_Len);
fsp_err_t HW_SCE_Aes192CcmDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes192CcmDecryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CcmDecryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_TextLen,
                                              uint32_t * InData_MAC,
                                              uint32_t * InData_MACLength,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes192CcmDecryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_MAC[],
                                          const uint32_t InData_MACLength[],
                                          uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Aes256CcmDecryptInitPrivate(sce_aes_key_index_t * KeyIndex,
                                             uint32_t            * InData_IV,
                                             uint32_t            * InData_Header,
                                             uint32_t              Header_Len);
fsp_err_t HW_SCE_Aes256CcmDecryptInitSub(uint32_t InData_KeyIndex[],
                                         uint32_t InData_IV[],
                                         uint32_t InData_Header[],
                                         uint32_t Header_Len);
fsp_err_t HW_SCE_Aes256CcmDecryptInitSubGeneral(uint32_t InData_KeyType[],
                                                uint32_t InData_DataType[],
                                                uint32_t InData_Cmd[],
                                                uint32_t InData_TextLen[],
                                                uint32_t InData_MACLength[],
                                                uint32_t InData_KeyIndex[],
                                                uint32_t InData_IV[],
                                                uint32_t InData_Header[],
                                                uint32_t InData_SeqNum[],
                                                uint32_t Header_Len);
fsp_err_t HW_SCE_Aes256CcmDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
void      HW_SCE_Aes256CcmDecryptUpdateSub(const uint32_t InData_Text[], uint32_t OutData_Text[],
                                           const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CcmDecryptFinalPrivate(uint32_t * InData_Text,
                                              uint32_t * InData_TextLen,
                                              uint32_t * InData_MAC,
                                              uint32_t * InData_MACLength,
                                              uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes256CcmDecryptFinalSub(const uint32_t InData_Text[],
                                          const uint32_t InData_TextLen[],
                                          const uint32_t InData_MAC[],
                                          const uint32_t InData_MACLength[],
                                          uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Ghash(uint32_t InData_HV[],
                       uint32_t InData_IV[],
                       uint32_t InData_Text[],
                       uint32_t OutData_DataT[],
                       uint32_t MAX_CNT);
fsp_err_t HW_SCE_GhashSub(uint32_t * InData_HV,
                          uint32_t * InData_IV,
                          uint32_t * InData_Text,
                          uint32_t * OutData_DataT,
                          uint32_t   MAX_CNT);
fsp_err_t HW_SCE_Aes128CmacGenerateInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes128CmacGenerateUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CmacGenerateFinalPrivate(uint32_t All_Msg_Len, uint32_t * InData_Text, uint32_t * OutData_DataT);
fsp_err_t HW_SCE_Aes256CmacGenerateInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes256CmacGenerateUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CmacGenerateFinalPrivate(uint32_t All_Msg_Len, uint32_t * InData_Text, uint32_t * OutData_DataT);
fsp_err_t HW_SCE_Aes128CmacVerifyInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes128CmacVerifyUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CmacVerifyFinalPrivate(uint32_t   All_Msg_Len,
                                              uint32_t * InData_Text,
                                              uint32_t * InData_DataT,
                                              uint32_t * InData_DataTLen);
fsp_err_t HW_SCE_Aes256CmacVerifyInitPrivate(sce_aes_key_index_t * key_index);
fsp_err_t HW_SCE_Aes256CmacVerifyUpdatePrivate(uint32_t * InData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CmacVerifyFinalPrivate(uint32_t   All_Msg_Len,
                                              uint32_t * InData_Text,
                                              uint32_t * InData_DataT,
                                              uint32_t * InData_DataTLen);
fsp_err_t HW_SCE_Aes128CmacInit(const uint32_t InData_KeyType[], const uint32_t InData_KeyIndex[]);
fsp_err_t HW_SCE_Aes128CmacInitSub(uint32_t InData_KeyIndex[]);
void      HW_SCE_Aes128CmacUpdate(const uint32_t InData_Text[], const uint32_t MAX_CNT);
void      HW_SCE_Aes128CmacUpdateSub(uint32_t InData_Text[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128CmacFinal(const uint32_t InData_Cmd[],
                                 const uint32_t InData_Text[],
                                 const uint32_t InData_DataT[],
                                 const uint32_t InData_DataTLen[],
                                 uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes128CmacFinalSub(uint32_t InData_Cmd[],
                                    uint32_t InData_Text[],
                                    uint32_t InData_DataT[],
                                    uint32_t InData_DataTLen[],
                                    uint32_t OutData_DataT[]);
fsp_err_t HW_SCE_Aes192CmacInit(const uint32_t InData_KeyType[], const uint32_t InData_KeyIndex[]);
fsp_err_t HW_SCE_Aes192CmacInitSub(uint32_t * InData_KeyIndex);
void      HW_SCE_Aes192CmacUpdate(const uint32_t InData_Text[], const uint32_t MAX_CNT);
void      HW_SCE_Aes192CmacUpdateSub(uint32_t * InData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192CmacFinal(const uint32_t InData_Cmd[],
                                 const uint32_t InData_Text[],
                                 const uint32_t InData_DataT[],
                                 const uint32_t InData_DataTLen[],
                                 uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes192CmacFinalSub(uint32_t * InData_Cmd,
                                    uint32_t * InData_Text,
                                    uint32_t * InData_DataT,
                                    uint32_t * InData_DataTLen,
                                    uint32_t * OutData_DataT);
fsp_err_t HW_SCE_Aes256CmacInit(const uint32_t InData_KeyType[], const uint32_t InData_KeyIndex[]);
fsp_err_t HW_SCE_Aes256CmacInitSub(uint32_t InData_KeyIndex[]);
void      HW_SCE_Aes256CmacUpdate(const uint32_t InData_Text[], const uint32_t MAX_CNT);
void      HW_SCE_Aes256CmacUpdateSub(uint32_t InData_Text[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256CmacFinal(const uint32_t InData_Cmd[],
                                 const uint32_t InData_Text[],
                                 const uint32_t InData_DataT[],
                                 const uint32_t InData_DataTLen[],
                                 uint32_t       OutData_DataT[]);
fsp_err_t HW_SCE_Aes256CmacFinalSub(uint32_t InData_Cmd[],
                                    uint32_t InData_Text[],
                                    uint32_t InData_DataT[],
                                    uint32_t InData_DataTLen[],
                                    uint32_t OutData_DataT[]);
fsp_err_t HW_SCE_Aes128KeyWrapPrivate(uint32_t * InData_KeyIndex,
                                      uint32_t * InData_WrappedKeyType,
                                      uint32_t * InData_WrappedKeyIndex,
                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes256KeyWrapPrivate(uint32_t * InData_KeyIndex,
                                      uint32_t * InData_WrappedKeyType,
                                      uint32_t * InData_WrappedKeyIndex,
                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Aes128KeyUnWrapPrivate(uint32_t * InData_KeyIndex,
                                        uint32_t * InData_WrappedKeyType,
                                        uint32_t * InData_Text,
                                        uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_Aes256KeyUnWrapPrivate(uint32_t * InData_KeyIndex,
                                        uint32_t * InData_WrappedKeyType,
                                        uint32_t * InData_Text,
                                        uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_KeyUnwrapPrivate(uint32_t * InData_KeyIndex, uint32_t * InData_Text, uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_Aes128EncryptDecryptInitSub(const uint32_t InData_KeyType[],
                                             const uint32_t InData_Cmd[],
                                             const uint32_t InData_KeyIndex[],
                                             const uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes128EncryptDecryptInitSubAdaptor(const uint32_t InData_KeyMode[],
                                                    const uint32_t InData_Cmd[],
                                                    const uint32_t InData_KeyIndex[],
                                                    const uint32_t InData_Key[],
                                                    const uint32_t InData_IV[]);
void HW_SCE_Aes128EncryptDecryptUpdateSub(const uint32_t InData_Text[],
                                          uint32_t       OutData_Text[],
                                          const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes128EncryptDecryptFinalSub(void);
fsp_err_t HW_SCE_Aes192EncryptDecryptInitSub(const uint32_t InData_Cmd[],
                                             const uint32_t InData_KeyIndex[],
                                             const uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes192EncryptDecryptInitSubAdaptor(const uint32_t InData_KeyMode[],
                                                    const uint32_t InData_Cmd[],
                                                    const uint32_t InData_KeyIndex[],
                                                    const uint32_t InData_Key[],
                                                    const uint32_t InData_IV[]);
void HW_SCE_Aes192EncryptDecryptUpdateSub(const uint32_t InData_Text[],
                                          uint32_t       OutData_Text[],
                                          const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes192EncryptDecryptFinalSub(void);
fsp_err_t HW_SCE_Aes256EncryptDecryptInitSub(const uint32_t InData_KeyType[],
                                             const uint32_t InData_Cmd[],
                                             const uint32_t InData_KeyIndex[],
                                             const uint32_t InData_IV[]);
fsp_err_t HW_SCE_Aes256EncryptDecryptInitSubAdaptor(const uint32_t InData_KeyMode[],
                                                    const uint32_t InData_Cmd[],
                                                    const uint32_t InData_KeyIndex[],
                                                    const uint32_t InData_Key[],
                                                    const uint32_t InData_IV[]);
void HW_SCE_Aes256EncryptDecryptUpdateSub(const uint32_t InData_Text[],
                                          uint32_t       OutData_Text[],
                                          const uint32_t MAX_CNT);
fsp_err_t HW_SCE_Aes256EncryptDecryptFinalSub(void);

