michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
/* -------- TDES -------- */
fsp_err_t HW_SCE_TdesEcbEncryptInitPrivate(sce_tdes_key_index_t * key_index);
fsp_err_t HW_SCE_TdesEcbEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_TdesEcbEncryptFinalPrivate(void);
fsp_err_t HW_SCE_TdesEcbDecryptInitPrivate(sce_tdes_key_index_t * key_index);
fsp_err_t HW_SCE_TdesEcbDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_TdesEcbDecryptFinalPrivate(void);
fsp_err_t HW_SCE_TdesCbcEncryptInitPrivate(sce_tdes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_TdesCbcEncryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_TdesCbcEncryptFinalPrivate(void);
fsp_err_t HW_SCE_TdesCbcDecryptInitPrivate(sce_tdes_key_index_t * key_index, uint32_t * InData_IV);
fsp_err_t HW_SCE_TdesCbcDecryptUpdatePrivate(uint32_t * InData_Text, uint32_t * OutData_Text, uint32_t MAX_CNT);
fsp_err_t HW_SCE_TdesCbcDecryptFinalPrivate(void);

/* -------- Hash (MD5 / SHA) -------- */
fsp_err_t HW_SCE_Md5InitPrivate(sce_sha_md5_handle_t * handle);
fsp_err_t HW_SCE_Md5UpdatePrivate(sce_sha_md5_handle_t * handle, uint32_t * InData_PaddedMsg, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Md5FinalPrivate(sce_sha_md5_handle_t * handle,
                                 uint32_t             * InData_PaddedMsg,
                                 uint32_t               MAX_CNT,
                                 uint32_t             * OutData_MsgDigest,
                                 uint32_t             * OutData_Length);
fsp_err_t HW_SCE_Sha1InitPrivate(sce_sha_md5_handle_t * handle);
fsp_err_t HW_SCE_Sha1UpdatePrivate(sce_sha_md5_handle_t * handle, uint32_t * InData_PaddedMsg, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Sha1FinalPrivate(sce_sha_md5_handle_t * handle,
                                  uint32_t             * InData_PaddedMsg,
                                  uint32_t               MAX_CNT,
                                  uint32_t             * OutData_MsgDigest,
                                  uint32_t             * OutData_Length);
fsp_err_t HW_SCE_Sha256InitPrivate(sce_sha_md5_handle_t * handle);
fsp_err_t HW_SCE_Sha256UpdatePrivate(sce_sha_md5_handle_t * handle, uint32_t * InData_PaddedMsg, uint32_t MAX_CNT);
fsp_err_t HW_SCE_Sha256FinalPrivate(sce_sha_md5_handle_t * handle,
                                    uint32_t             * InData_PaddedMsg,
                                    uint32_t               MAX_CNT,
                                    uint32_t             * OutData_MsgDigest,
                                    uint32_t             * OutData_Length);
fsp_err_t HW_SCE_Sha224256GenerateMessageDigestSub(const uint32_t InData_InitVal[],
                                                   const uint32_t InData_PaddedMsg[],
                                                   const uint32_t MAX_CNT,
                                                   uint32_t       OutData_MsgDigest[]);
fsp_err_t HW_SCE_ShaGenerateMessageDigestSub(const uint32_t InData_HashType[],
                                             const uint32_t InData_Cmd[],
                                             const uint32_t InData_Msg[],
                                             const uint32_t InData_MsgLen[],
                                             const uint32_t InData_State[],
                                             uint32_t       OutData_MsgDigest[],
                                             uint32_t       OutData_State[],
                                             const uint32_t MAX_CNT);
fsp_err_t HW_SCE_ShaGenerateMessageDigestSubGeneral(const uint32_t InData_HashType[],
                                                    const uint32_t InData_Cmd[],
                                                    const uint32_t InData_Msg[],
                                                    const uint32_t InData_MsgLen[],
                                                    const uint32_t InData_State[],
                                                    uint32_t       OutData_MsgDigest[],
                                                    uint32_t       OutData_State[],
                                                    const uint32_t MAX_CNT,
                                                    const uint32_t InData_InitVal[]);
fsp_err_t HW_SCE_ShaGenerateMessageDigestSubAdaptor(const uint32_t InData_InitVal[],
                                                    const uint32_t InData_PaddedMsg[],
                                                    uint32_t       OutData_MsgDigest[],
                                                    const uint32_t MAX_CNT);

/* -------- HMAC -------- */
fsp_err_t HW_SCE_Sha1HmacGenerateInitPrivate(sce_hmac_sha_handle_t * handle, sce_hmac_sha_key_index_t * key_index);
fsp_err_t HW_SCE_Sha1HmacGenerateUpdatePrivate(sce_hmac_sha_handle_t * handle,
                                               uint32_t              * InData_PaddedMsg,
                                               uint32_t                MAX_CNT);
fsp_err_t HW_SCE_Sha1HmacGenerateFinalPrivate(sce_hmac_sha_handle_t * handle, uint32_t * OutData_Mac);
fsp_err_t HW_SCE_Sha256HmacGenerateInitPrivate(sce_hmac_sha_handle_t * handle, sce_hmac_sha_key_index_t * key_index);
fsp_err_t HW_SCE_Sha256HmacGenerateUpdatePrivate(sce_hmac_sha_handle_t * handle,
                                                 uint32_t              * InData_PaddedMsg,
                                                 uint32_t                MAX_CNT);
fsp_err_t HW_SCE_Sha256HmacGenerateFinalPrivate(sce_hmac_sha_handle_t * handle, uint32_t * OutData_Mac);
fsp_err_t HW_SCE_Sha1HmacVerifyInitPrivate(sce_hmac_sha_handle_t * handle, sce_hmac_sha_key_index_t * key_index);
fsp_err_t HW_SCE_Sha1HmacVerifyUpdatePrivate(sce_hmac_sha_handle_t * handle,
                                             uint32_t              * InData_PaddedMsg,
                                             uint32_t                MAX_CNT);
fsp_err_t HW_SCE_Sha1HmacVerifyFinalPrivate(sce_hmac_sha_handle_t * handle,
                                            uint32_t              * InData_Mac,
                                            uint32_t              * InData_length);
fsp_err_t HW_SCE_Sha256HmacInitSub(uint32_t InData_KeyType[], uint32_t InData_KeyIndex[], uint32_t LEN);
fsp_err_t HW_SCE_Sha256HmacVerifyInitPrivate(sce_hmac_sha_handle_t * handle, sce_hmac_sha_key_index_t * key_index);
void      HW_SCE_Sha256HmacUpdateSub(uint32_t InData_PaddedMsg[], uint32_t MAX_CNT);
fsp_err_t HW_SCE_Sha256HmacVerifyUpdatePrivate(sce_hmac_sha_handle_t * handle,
                                               uint32_t              * InData_PaddedMsg,
                                               uint32_t                MAX_CNT);
fsp_err_t HW_SCE_Sha256HmacFinalSub(uint32_t InData_Cmd[],
                                    uint32_t InData_MAC[],
                                    uint32_t InData_length[],
                                    uint32_t OutData_MAC[]);
fsp_err_t HW_SCE_Sha256HmacVerifyFinalPrivate(sce_hmac_sha_handle_t * handle,
                                              uint32_t              * InData_Mac,
                                              uint32_t              * InData_length);

/* -------- RSA -------- */
fsp_err_t HW_SCE_Rsa1024ModularExponentEncryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa1024ModularExponentEncryptSub(const uint32_t InData_KeyIndex[],
                                                  const uint32_t InData_Text[],
                                                  uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa1024ModularExponentEncryptSubAdaptor(const uint32_t InData_KeyIndex[],
                                                         const uint32_t InData_Key[],
                                                         const uint32_t InData_Text[],
                                                         uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa1024ModularExponentDecryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa1024ModularExponentDecryptSub(uint32_t       InData_KeyIndex[],
                                                  const uint32_t InData_Text[],
                                                  uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa1024ModularExponentDecryptSubAdaptor(const uint32_t InData_KeyMode[],
                                                         uint32_t       InData_KeyIndex[],
                                                         const uint32_t InData_Key[],
                                                         const uint32_t InData_Text[],
                                                         uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa2048ModularExponentEncryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa2048ModularExponentEncryptSub(const uint32_t InData_KeyIndex[],
                                                  const uint32_t InData_Text[],
                                                  uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa2048ModularExponentEncryptSubAdaptor(const uint32_t InData_KeyIndex[],
                                                         const uint32_t InData_Key[],
                                                         const uint32_t InData_Text[],
                                                         uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa2048ModularExponentDecryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa2048ModularExponentDecryptSub(uint32_t       InData_KeyIndex[],
                                                  const uint32_t InData_Text[],
                                                  uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa2048ModularExponentDecryptSubAdaptor(const uint32_t InData_KeyMode[],
                                                         uint32_t       InData_KeyIndex[],
                                                         const uint32_t InData_Key[],
                                                         const uint32_t InData_Text[],
                                                         uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa3072ModularExponentEncryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa3072ModularExponentEncryptSub(const uint32_t InData_KeyIndex[],
                                                  const uint32_t InData_Text[],
                                                  uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa3072ModularExponentEncryptSubAdaptor(const uint32_t InData_KeyIndex[],
                                                         const uint32_t InData_Key[],
                                                         const uint32_t InData_Text[],
                                                         uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa3072ModularExponentDecryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa3072ModularExponentDecryptSub(uint32_t * InData_KeyIndex,
                                                  uint32_t * InData_Text,
                                                  uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa4096ModularExponentEncryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa4096ModularExponentEncryptSub(const uint32_t InData_KeyIndex[],
                                                  const uint32_t InData_Text[],
                                                  uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa4096ModularExponentEncryptSubAdaptor(const uint32_t InData_KeyIndex[],
                                                         const uint32_t InData_Key[],
                                                         const uint32_t InData_Text[],
                                                         uint32_t       OutData_Text[]);
fsp_err_t HW_SCE_Rsa4096ModularExponentDecryptPrivate(uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_Text,
                                                      uint32_t * OutData_Text);
fsp_err_t HW_SCE_Rsa4096ModularExponentDecryptSub(uint32_t * InData_KeyIndex,
                                                  uint32_t * InData_Text,
                                                  uint32_t * OutData_Text);

/* -------- ECDSA -------- */
fsp_err_t HW_SCE_EcdsaP384SignatureGenerateSub(const uint32_t InData_CurveType[],
                                               const uint32_t InData_KeyIndex[],
                                               const uint32_t InData_MsgDgst[],
                                               uint32_t       OutData_Signature[]);
fsp_err_t HW_SCE_EcdsaP384SignatureGenerateSubAdaptor(const uint32_t InData_CurveType[],
                                                      const uint32_t InData_KeyIndex[],
                                                      const uint32_t InData_MsgDgst[],
                                                      const uint32_t InData_DomainParam[],
                                                      uint32_t       OutData_Signature[]);
fsp_err_t HW_SCE_EcdsaSignatureGenerateSub(const uint32_t InData_CurveType[],
                                           const uint32_t InData_Cmd[],
                                           const uint32_t InData_KeyIndex[],
                                           const uint32_t InData_MsgDgst[],
                                           uint32_t       OutData_Signature[]);
fsp_err_t HW_SCE_EcdsaSignatureGenerateSubAdaptor(const uint32_t InData_CurveType[],
                                                  const uint32_t InData_Cmd[],
                                                  const uint32_t InData_KeyIndex[],
                                                  const uint32_t InData_MsgDgst[],
                                                  const uint32_t InData_DomainParam[],
                                                  uint32_t       OutData_Signature[]);
fsp_err_t HW_SCE_EcdsaP384SignatureVerificationSub(const uint32_t InData_CurveType[],
                                                   const uint32_t InData_KeyIndex[],
                                                   const uint32_t InData_MsgDgst[],
                                                   const uint32_t InData_Signature[]);
fsp_err_t HW_SCE_EcdsaP384SignatureVerificationSubAdaptor(const uint32_t InData_CurveType[],
                                                          const uint32_t InData_KeyIndex[],
                                                          const uint32_t InData_Key[],
                                                          const uint32_t InData_MsgDgst[],
                                                          const uint32_t InData_Signature[],
                                                          const uint32_t InData_DomainParam[]);
fsp_err_t HW_SCE_EcdsaSignatureVerificationSub(const uint32_t InData_CurveType[],
                                               const uint32_t InData_Cmd[],
                                               const uint32_t InData_KeyIndex[],
                                               const uint32_t InData_MsgDgst[],
                                               const uint32_t InData_Signature[]);
fsp_err_t HW_SCE_EcdsaSignatureVerificationSubAdaptor(const uint32_t InData_CurveType[],
                                                      const uint32_t InData_Cmd[],
                                                      const uint32_t InData_KeyIndex[],
                                                      const uint32_t InData_Key[],
                                                      const uint32_t InData_MsgDgst[],
                                                      const uint32_t InData_Signature[],
                                                      const uint32_t InData_DomainParam[]);

/* -------- ECDH -------- */
fsp_err_t HW_SCE_EcdhReadPublicKeyPrivate(uint32_t * InData_Cmd,
                                          uint32_t * InData_KeyIndex,
                                          uint32_t * InData_data,
                                          uint32_t * InData_Signature,
                                          uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_EcdhMakePublicKeyPrivate(uint32_t * InData_Cmd,
                                          uint32_t * InData_KeyType,
                                          uint32_t * InData_PubKeyIndex,
                                          uint32_t * InData_PrivKeyIndex,
                                          uint32_t * InData_key_id,
                                          uint32_t * OutData_data,
                                          uint32_t * OutData_Signature,
                                          uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_EcdhCalculateSharedSecretIndexPrivate(uint32_t * InData_KeyType,
                                                       uint32_t * InData_PubKeyIndex,
                                                       uint32_t * InData_PrivKeyIndex,
                                                       uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_EcdhKeyDerivationPrivate(uint32_t * InData_KeyIndex,
                                          uint32_t * InData_PaddedMsg,
                                          uint32_t   MAX_CNT,
                                          uint32_t * OutData_KeyIndex);

/* -------- DLMS / COSEM -------- */
fsp_err_t HW_SCE_DlmsCosemCalculateZSub(uint32_t * InData_KeyType,
                                        uint32_t * InData_PubKeyIndex,
                                        uint32_t * InData_PrivKeyIndex,
                                        uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_DlmsCosemCalculateKekSub(uint32_t * InData_KeyIndex,
                                          uint32_t * InData_PaddedMsg,
                                          uint32_t   MAX_CNT,
                                          uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_DlmsCosemKeyUnwrapSub(uint32_t * InData_KeyIndex, uint32_t * InData_Text, uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_DlmsCosemQeuSignatureVerificationSub(uint32_t * InData_Cmd,
                                                      uint32_t * InData_KeyIndex,
                                                      uint32_t * InData_data,
                                                      uint32_t * InData_Signature,
                                                      uint32_t * OutData_KeyIndex);
fsp_err_t HW_SCE_DlmsCosemQevSignatureGenerationSub(uint32_t * InData_Cmd,
                                                    uint32_t * InData_KeyType,
                                                    uint32_t * InData_PubKeyIndex,
                                                    uint32_t * InData_PrivKeyIndex,
                                                    uint32_t * InData_key_id,
                                                    uint32_t * OutData_data,
                                                    uint32_t * OutData_Signature,
                                                    uint32_t * OutData_KeyIndex);

