michaelthomasj/fsp_cmake/ra6m5_iar_mcuboot/ra/fsp/src/r_sce/crypto_procedures/src/sce9/plainkey/private/inc/hw_sce_ra_private.h
/* -------- TLS -------- */
fsp_err_t HW_SCE_TlsRootCertificateVerificationSub(uint32_t * InData_Sel_PubKeyType,
                                                   uint32_t * InData_Certificates,
                                                   uint32_t * InData_CertificatesLength,
                                                   uint32_t * InData_Signature,
                                                   uint32_t * InData_CertificatesInfo,
                                                   uint32_t   length,
                                                   uint32_t * OutData_PubKey);
fsp_err_t HW_SCE_TlsCertificateVerificationSub(uint32_t * InData_Sel_PubKeyType,
                                               uint32_t * InData_PubKey,
                                               uint32_t * InData_TBSCertificate,
                                               uint32_t * InData_TBSCertificateLength,
                                               uint32_t * InData_Signature,
                                               uint32_t * InData_TBSCertificateInfo,
                                               uint32_t   length,
                                               uint32_t * OutData_PubKey);
fsp_err_t HW_SCE_TlsGeneratePreMasterSecretSub(uint32_t * OutData_PreMasterSecret);
fsp_err_t HW_SCE_TlsGenerateMasterSecretSub(uint32_t * InData_Sel_CipherSuite,
                                            uint32_t * InData_PreMasterSecret,
                                            uint32_t * InData_ClientRandom,
                                            uint32_t * InData_ServerRandom,
                                            uint32_t * OutData_MasterSecret);
fsp_err_t HW_SCE_TlsGenerateSessionKeySub(uint32_t * InData_Sel_CipherSuite,
                                          uint32_t * InData_MasterSecret,
                                          uint32_t * InData_ClientRandom,
                                          uint32_t * InData_ServerRandom,
                                          uint32_t * InData_NonceExplicit,
                                          uint32_t * OutData_ClientMACKeyOperationCode,
                                          uint32_t * OutData_ServerMACKeyOperationCode,
                                          uint32_t * OutData_ClientEncKeyOperationCode,
                                          uint32_t * OutData_ServerEncKeyOperationCode,
                                          uint32_t   OutLen);
fsp_err_t HW_SCE_TlsGenerateVerifyDataSub(uint32_t * InData_Sel_VerifyData,
                                          uint32_t * InData_MasterSecret,
                                          uint32_t * InData_HandShakeHash,
                                          uint32_t * OutData_VerifyData);
fsp_err_t HW_SCE_TlsGeneratePreMasterSecretWithEccP256KeySub(uint32_t * InData_PubKey,
                                                             uint32_t * InData_KeyIndex,
                                                             uint32_t * OutData_PreMasterSecretIndex);
fsp_err_t HW_SCE_TlsServersEphemeralEcdhPublicKeyRetrievesSub(uint32_t * InData_Sel_PubKeyType,
                                                              uint32_t * InData_ClientRandom,
                                                              uint32_t * InData_ServerRandom,
                                                              uint32_t * InData_Sel_CompressType,
                                                              uint32_t * InData_SKE_Message,
                                                              uint32_t * InData_SKE_Signature,
                                                              uint32_t * InData_PubKey,
                                                              uint32_t * OutData_EphemeralPubKey);
fsp_err_t HW_SCE_TlsEncryptPreMasterSecretSub(uint32_t * InData_PubKey,
                                              uint32_t * InData_PreMasterSecret,
                                              uint32_t * OutData_PreMasterSecret);
void HW_SCE_TlsGenerateSubSub(void);
void HW_SCE_TlsRootCertificateVerificationSubSub(void);

/* -------- Low-level Numbered Primitives -------- */
void HW_SCE_p_func000(uint32_t InData_PaddedMsg[], uint32_t MAX_CNT);
void HW_SCE_p_func001(void);
void HW_SCE_p_func002(void);
void HW_SCE_p_func027_r2(uint32_t ARG1);
void HW_SCE_p_func028_r2(uint32_t ARG1);
void HW_SCE_p_func031(uint32_t ARG1[]);
void HW_SCE_p_func043(void);
void HW_SCE_p_func044(void);
void HW_SCE_p_func048(uint32_t ARG1[]);
void HW_SCE_p_func049(uint32_t ARG1[]);
void HW_SCE_p_func050(uint32_t ARG1);
void HW_SCE_p_func051(void);
void HW_SCE_p_func052(uint32_t ARG1);
void HW_SCE_p_func053(uint32_t ARG1);
void HW_SCE_p_func054(uint32_t ARG1, uint32_t ARG2);
void HW_SCE_p_func057_r1(uint32_t ARG1[], uint32_t ARG2[], uint32_t ARG3[]);
void HW_SCE_p_func058(uint32_t ARG1[], uint32_t ARG2);
void HW_SCE_p_func059(void);
void HW_SCE_p_func060(void);
void HW_SCE_p_func061(uint32_t ARG1, uint32_t ARG2[]);
void HW_SCE_p_func062(uint32_t ARG1, uint32_t ARG2[]);
void HW_SCE_p_func063(uint32_t ARG1, uint32_t ARG2[]);
void HW_SCE_p_func064(uint32_t ARG1, uint32_t ARG2[]);
void HW_SCE_p_func065_r1(uint32_t ARG1[], uint32_t ARG2[]);
void HW_SCE_p_func066(uint32_t ARG1, uint32_t ARG2[]);
void HW_SCE_p_func067(uint32_t ARG1, uint32_t ARG2[]);
void HW_SCE_p_func068(void);
void HW_SCE_p_func070_r2(uint32_t ARG1);
void HW_SCE_p_func071_r2(uint32_t ARG1);
void HW_SCE_p_func074_r1(void);
void HW_SCE_p_func075_r1(void);
void HW_SCE_p_func076(void);
void HW_SCE_p_func077(void);
void HW_SCE_p_func080(void);
void HW_SCE_p_func081(void);
void HW_SCE_p_func082(void);
void HW_SCE_p_func100(const uint32_t ARG1[]);
void HW_SCE_p_func101(const uint32_t ARG1[]);
void HW_SCE_p_func102(const uint32_t ARG1[]);
void HW_SCE_p_func103(void);
void HW_SCE_p_func200(void);
void HW_SCE_p_func202(void);
void HW_SCE_p_func205(void);
void HW_SCE_p_func206(void);
void HW_SCE_p_func207(void);
void HW_SCE_p_func300(void);
void HW_SCE_p_func301(void);
void HW_SCE_p_func302(void);
void HW_SCE_p_func304_r1(void);
void HW_SCE_p_func307_r1(void);
void HW_SCE_p_func308(void);
void HW_SCE_p_func309_r1(void);
void HW_SCE_p_func310(void);
void HW_SCE_p_func311_r1(void);
void HW_SCE_p_func312(uint32_t ARG1);
void HW_SCE_p_func313(uint32_t ARG1);
void HW_SCE_p_func314(uint32_t ARG1);
void HW_SCE_p_func315(uint32_t ARG1);
void HW_SCE_p_func316(void);
void HW_SCE_p_func317(void);
void HW_SCE_p_func318(void);
void HW_SCE_p_func319(uint32_t ARG1);
void HW_SCE_p_func320(uint32_t ARG1);
void HW_SCE_p_func321(uint32_t ARG1);
void HW_SCE_p_func322(uint32_t ARG1);
void HW_SCE_p_func323(void);
void HW_SCE_p_func324(void);
void HW_SCE_p_func325_r1(void);

#endif                                 /* HW_SCE_RA_PRIVATE_HEADER_FILE */
